welcome-to-NNotes.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Bienvenue chez NNotes</title>
<!-- 2015-02-10 Mar 16:34 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Pierre-Henry Frohring" />
</head>
<body>
<div id="content">
<h1 class="title">Bienvenue chez NNotes</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Bienvenue dans le projet NNotes</a>
<ul>
<li><a href="#sec-1-1">1.1. Le projet</a></li>
<li><a href="#sec-1-2">1.2. Le deal</a></li>
<li><a href="#sec-1-3">1.3. L'entreprise</a></li>
<li><a href="#sec-1-4">1.4. Implémenter un projet</a>
<ul>
<li><a href="#sec-1-4-1">1.4.1. The tale of two bridges</a></li>
<li><a href="#sec-1-4-2">1.4.2. Modalités</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Bienvenue dans le projet NNotes</h2>
<div class="outline-text-2" id="text-1">
<p>
Vous venez de discuter avec au moins un membre de l'équipe NNotes et il vous a
remis ce fichier.  Après avoir discuté, il est maintenant temps de mettre les
mains dans le cambouis !
</p>
</div>



<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> Le projet</h3>
<div class="outline-text-3" id="text-1-1">
<p>
NNotes propose à chacun d'assimiler/publier des connaissances de niveau
universitaire, et d'être rémunéré pour le faire.  À travers sa plate-forme
web, NNotes s'attaque à certains problèmes liés à
l'assimilation/publication : coût de production, de partage, de mise à jour,
et d'assimilation des connaissances.
</p>

<p>
NNotes et le fond d'investissement IT-translation se réunissent une fois par
semaine pour faire de la plate-forme web actuelle le coeur d'une nouvelle façon
de créer et transmettre des connaissances et d'être rémunéré pour le faire.
</p>

<p>
Concrètement, NNotes à besoin de compléter l'équipe d'ici juin prochain.  Nous
espérons la compléter avec quelques-uns d'entre vous.
</p>
</div>
</div>



<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> Le deal</h3>
<div class="outline-text-3" id="text-1-2">
<p>
L'équipe NNotes discute avec vous de projets à implémenter et vous vous mettez
d'accord sur l'un d'entre eux.
</p>

<p>
Pendant l'implémentation du projet, n'hésitez pas à solliciter l'équipe
NNotes.  Le projet sera éventuellement intégré à la plate-forme NNotes, au
plus tard en juillet prochain.
</p>

<p>
Si le projet que vous aurez implémenté est intégré à la plate-forme NNotes
alors nous discuterons de sa rémunération, de la poursuite par un stage,
voire d'un recrutement comme membre à part entière de l'équipe NNotes.
</p>

<p>
Si le projet n'est pas intégré à la plate-forme NNotes alors vous aurez
bénéficié de tous nos efforts pour vous faire toucher du doigts la création,
le développement et potentiellement le crash ou la réussite d'une startup.
Nous vous encourageons déjà de retenter votre chance avec nous !
</p>
</div>
</div>



<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> L'entreprise</h3>
<div class="outline-text-3" id="text-1-3">
<p>
Nous suivons les traces de Valve, jetez un coup d'oeil à leur gestion de
l'entreprise, ça vaut le détour :-).
</p>

<p>
<a href="http://www.valvesoftware.com/company/Valve_Handbook_LowRes.pdf">Valve handbook</a>
</p>

<p>
Nous avons bien conscience que Valve est quelques centaines d'employés,
quelques milliards et quelques immenses succès au loin.  La route est longue,
mais nous espérons nous rapprocher d'eux.
</p>

<p>
En attendant, voici notre propre
<a href="https://github.com/nomosyn/resources/">NNotes handbook</a>, largement inspiré
du leur.
</p>
</div>
</div>




<div id="outline-container-sec-1-4" class="outline-3">
<h3 id="sec-1-4"><span class="section-number-3">1.4</span> Implémenter un projet</h3>
<div class="outline-text-3" id="text-1-4">
</div><div id="outline-container-sec-1-4-1" class="outline-4">
<h4 id="sec-1-4-1"><span class="section-number-4">1.4.1</span> The tale of two bridges</h4>
<div class="outline-text-4" id="text-1-4-1">
<p>
Two old engineers were talking of their lives and boasting of their
greatest projects. One of the engineers explained how he had designed the
largest bridge ever made.
</p>

<p>
"We built it across a river gorge," he told his friend. "It was wide and
deep. We spent two years studying the land, and choosing designs. Then we
hired the best people and designed the bridge, which took another five
years. We contracted the largest engineering firms to build the structures,
the towers, the tollbooths, and the roads that would connect the bridge to
the main highways. Under the road level we had trains, and a special path
for cyclists. That bridge represented years of my life."
</p>

<p>
The second man reflected for a while, then spoke. "One evening me and a
friend threw a rope across a gorge," he said. "Just a rope, tied to two
trees. There were two villages, one at each side. At first, people pulled
packages across that rope with a pulley and string. Then someone pulled
across a second rope, and built a foot walk. It was dangerous, but the kids
loved it. A group of men then rebuilt that, made it solid, and women
started to cross, everyday, with their produce. A market grew up on one
side of the bridge, and slowly that became a large town, since there was a
lot of space for houses. The rope bridge got replaced with a wooden bridge,
to allow horses and carts to cross. Then the town built a real stone
bridge, with metal beams. Later, they replaced the stone part with steel,
and today there's a suspension bridge standing in that same spot."
</p>

<p>
The first engineer was silent. "Funny thing," he said, "my bridge was
demolished not long after it was built. Turns out it was built in the wrong
place and no-one wanted to use it. Some bastard had thrown a rope across
the gorge, a few miles further downstream, and that's where everyone went."
</p>

<p>
This article is an extract from Chapter 6 of the <a href="http://shop.oreilly.com/product/0636920026136.do">ZeroMQ book</a>, on community
building.
</p>
</div>
</div>



<div id="outline-container-sec-1-4-2" class="outline-4">
<h4 id="sec-1-4-2"><span class="section-number-4">1.4.2</span> Modalités</h4>
<div class="outline-text-4" id="text-1-4-2">
<ul class="org-ul">
<li>Une fois que nous nous serons mis d'accord sur le projet à implémenter, si
possible, trouvez au moins une autre personne avec qui avancer.
</li>

<li>En cas de problème n'hésitez pas à nous contacter
(frohring.pierrehenry@gmail.com, contact@bastienfaure.fr) et jetez un oeil
au <a href="https://github.com/nomosyn/resources/">NNotes handbook</a>
</li>
</ul>


<ul class="org-ul">
<li>Implémentez le projet sur GitHub !
<ul class="org-ul">
<li>$ <a href="https://www.meteor.com/">meteor</a> create my-project
</li>

<li>Gestion du projet: <a href="http://rfc.zeromq.org/spec:22">C4.1</a>
</li>

<li>Licence: <a href="https://www.mozilla.org/MPL/2.0/">MPLv2</a>
</li>

<li>Coding style: <a href="https://github.com/nomosyn/resources/">JS coding style</a>
</li>
</ul>
</li>
</ul>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Pierre-Henry Frohring</p>
<p class="date">Created: 2015-02-10 Mar 16:34</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.4.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
